[
  {
    "title": "Loan Application Portal",
    "description": "Digital self-service channel for customers to apply for personal and home loans online.",
    "route": "/loan-application",
    "userStories": [
      {
        "title": "Application Form Submission",
        "description": "Enables customers to submit loan applications digitally for supported loan types.",
        "component": "ApplicationFormSubmission",
        "tasks": [
          {
            "title": "Submit Loan Application",
            "description": "As a customer, I want to fill out and submit a loan application online so that I can apply for a personal or home loan conveniently.",
            "acceptance_criteria": [
              "Given a logged-in customer When they complete the application form and submit Then the application is saved and confirmation is shown",
              "[Edge] Given an application is missing required fields When the customer tries to submit Then an error message indicating the missing fields is displayed",
              "[Negative] Given a loan product is not supported When a customer selects it Then the product is not available for application"
            ]
          }
        ]
      },
      {
        "title": "Document Upload & Verification",
        "description": "Allows users to upload supporting documents and leverages OCR for automated verification.",
        "component": "DocumentUploadVerification",
        "tasks": [
          {
            "title": "Upload Supporting Documents",
            "description": "As a customer, I want to upload my ID and income documents so that the bank can verify my eligibility automatically.",
            "acceptance_criteria": [
              "Given a loan application When I upload valid documents Then the system accepts and verifies them using OCR",
              "[Edge] Given an uploaded document is unreadable or corrupted When OCR attempts verification Then the system flags the document for manual review and informs the user",
              "[Negative] Given a user uploads an unsupported file type When they attempt to submit Then an error message specifying supported formats is shown"
            ]
          }
        ]
      },
      {
        "title": "Application Status Tracking",
        "description": "Allows customers to check the real-time status of their loan applications.",
        "component": "ApplicationStatusTracking",
        "tasks": [
          {
            "title": "View Application Status",
            "description": "As a customer, I want to track my application status so that I know when my loan will be approved.",
            "acceptance_criteria": [
              "Given a submitted loan application When I log in and view the status page Then the current status (e.g., Under Review, Approved, Rejected) is displayed with timestamps",
              "[Edge] Given no existing applications When I visit the status page Then I see an empty state message and a 'Start New Application' CTA",
              "[Negative] Given I am not logged in When I try to access the application status Then I see a 401 Unauthorized error"
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Loan Management Dashboard",
    "description": "Internal system for Loan Officers and Underwriters to review, process and manage loan applications.",
    "route": "/loan-management",
    "userStories": [
      {
        "title": "Application Queue & Assignment",
        "description": "Displays pending loan applications and supports assignment to available officers/underwriters.",
        "component": "ApplicationQueueAssignment",
        "tasks": [
          {
            "title": "View and Assign Applications",
            "description": "As a loan officer, I want to view a queue of pending applications and assign them for review so that applications are handled efficiently.",
            "acceptance_criteria": [
              "Given multiple pending loan applications When I open the dashboard Then I see the list with status, applicant details, and assign options",
              "[Edge] Given an application has already been assigned When I attempt to assign it Then the assignment is prevented and a notification shown",
              "[Negative] Given I am not authenticated When I access the dashboard Then I receive a 401 Unauthorized response"
            ]
          }
        ]
      },
      {
        "title": "Manual Review and Override",
        "description": "Enables officers to manually review flagged applications or override automated decisions.",
        "component": "ManualReviewOverride",
        "tasks": [
          {
            "title": "Override Automated Decisions",
            "description": "As an underwriter, I want to manually review and override system decisions on applications so that exceptions and edge cases are handled correctly.",
            "acceptance_criteria": [
              "Given a flagged application When I open the details and select 'Override' Then I can provide a justification and finalize the decision",
              "[Edge] Given no justification is entered for an override When I attempt to submit Then the system prevents submission and requests justification",
              "[Negative] Given I lack override permissions When I attempt to override a decision Then I receive a 'Permission Denied' message"
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Automated Document Verification",
    "description": "Automates validation of uploaded documents using integrated OCR and triggers manual review on exceptions.",
    "route": "/document-verification",
    "userStories": [
      {
        "title": "OCR Integration",
        "description": "Integrates document OCR service for automatic extraction and verification of provided documents.",
        "component": "OCRIntegrationFeature",
        "tasks": [
          {
            "title": "Automatic Document Verification",
            "description": "As the system, I want to process uploaded documents via OCR so that loan processing is expedited and manual entry is minimized.",
            "acceptance_criteria": [
              "Given a batch of uploaded documents When OCR processing is completed Then validated results are stored and flagged exceptions are sent for manual review",
              "[Edge] Given OCR times out or produces low-confidence results When verifying documents Then the system triggers manual review and logs the event",
              "[Negative] Given document verification fails due to API unavailability When initiating OCR Then a fallback manual verification workflow is triggered"
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Credit Check Integration",
    "description": "Automates credit scoring of applicants by integrating with Credit Bureau API.",
    "route": "/credit-check",
    "userStories": [
      {
        "title": "Credit Score Retrieval",
        "description": "Fetches and displays applicant credit score during loan evaluation.",
        "component": "CreditScoreRetrievalFeature",
        "tasks": [
          {
            "title": "Retrieve Credit Score",
            "description": "As a loan officer, I want the system to automatically fetch applicant credit scores so that credit assessments are consistent and efficient.",
            "acceptance_criteria": [
              "Given valid applicant details When I review the application Then the system automatically displays the credit score from the bureau API",
              "[Edge] Given the bureau API returns incomplete data When fetching the credit score Then the system displays a warning and prompts for manual verification",
              "[Negative] Given the API is unavailable When attempting to retrieve the score Then the system logs the error and informs the user that manual credit check is required"
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Notifications and Reminders",
    "description": "Automates communication to applicants and internal users about application status updates and required actions.",
    "route": "/notifications",
    "userStories": [
      {
        "title": "Email & SMS Notifications",
        "description": "Sends automated status notifications and reminders at key stages of the process.",
        "component": "EmailSMSNotificationsFeature",
        "tasks": [
          {
            "title": "Send Status Notifications",
            "description": "As a customer, I want to receive updates via email and SMS at each stage of my loan application so that I am always informed of progress and required actions.",
            "acceptance_criteria": [
              "Given my application status changes (e.g., submitted, under review, approved, rejected) When the status is updated Then the system sends the appropriate notification via my chosen channels",
              "[Edge] Given user has opted out of notifications When status changes Then the system does not send a message",
              "[Negative] Given invalid contact details on file When a notification is triggered Then an error is logged and the notification is not sent"
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Reporting and Analytics",
    "description": "Provides system usage, compliance and performance analytics to business users.",
    "route": "/reports",
    "userStories": [
      {
        "title": "Loan Processing Reports",
        "description": "Displays data related to application processing times, manual interventions and customer satisfaction.",
        "component": "LoanProcessingReportsFeature",
        "tasks": [
          {
            "title": "View Loan Processing Metrics",
            "description": "As a business analyst, I want to access metrics on loan processing times, automation rates, and CSAT so that I can monitor objectives and compliance.",
            "acceptance_criteria": [
              "Given I am authorized When I access the reporting dashboard Then I can view updated metrics including automation percentage and CSAT scores",
              "[Edge] Given no loan applications processed in a period When viewing reports Then system displays 'No Data Available' for relevant charts",
              "[Negative] Given I am not authenticated When I try to access reporting Then access is denied with a 401 error"
            ]
          }
        ]
      }
    ]
  }
]